Revit 2026 API

# EnergyDataSettingsDividePerimeter Property

---

If this is true, zones with exterior boundaries on each floor of the building will be divided based on geometric criteria.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool DividePerimeter { get; set; }
```
```vb
Public Property DividePerimeter As Boolean
	Get
	Set
```
```cpp
public:
property bool DividePerimeter {
	bool get ();
	void set (bool value);
}
```
```fsharp
member DividePerimeter : bool with get, set
```

#### Property Value

Boolean

When the AnalysisType is ConceptualMasses, the division of the perimeter zones is based on the four compass directions. The quadrants will be True N, S, E, and W. The division of the quadrants will be along the axis of True NW to SE and True SW to NE. The intersection of the quadrants will be placed at the centroid of the zone. When the AnalysisType is not ConceptualMasses, the division of the perimeter zones is based on the difference of orientation, maximum length and depth. Any exterior surfaces that have an angle of 45 degrees or more between them will be divided into separate zones. Zones greater than 50 ft. will be divided equally. The CoreOffset will determine the depth of the zones. The purpose of these divisions is to ensure that auto-generated zoning is appropriate for thermal loads generated by the relative position of the building to the sun path.

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace